In [1]:
import numpy as np
import pandas as pd

In [2]:
'''1. Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.

  school class            name date_Of_Birth   age  height  weight  address
S1   s001     V  Alberto Franco     15/05/2002   12    173      35  street1
S2   s002     V    Gino Mcneill     17/05/2002   12    192      32  street2
S3   s003    VI     Ryan Parkes     16/02/1999   13    186      33  street3
S4   s001    VI    Eesha Hinton     25/09/1998   13    167      30  street1
S5   s002     V    Gino Mcneill     11/05/2002   14    151      31  street2
S6   s004    VI    David Parkes     15/09/1997   12    159      32  street4'''

'1. Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.\n\n  school class            name date_Of_Birth   age  height  weight  address\nS1   s001     V  Alberto Franco     15/05/2002   12    173      35  street1\nS2   s002     V    Gino Mcneill     17/05/2002   12    192      32  street2\nS3   s003    VI     Ryan Parkes     16/02/1999   13    186      33  street3\nS4   s001    VI    Eesha Hinton     25/09/1998   13    167      30  street1\nS5   s002     V    Gino Mcneill     11/05/2002   14    151      31  street2\nS6   s004    VI    David Parkes     15/09/1997   12    159      32  street4'

In [3]:
data_frame1 = {'school':['s001', 's002', 's003', 's001', 's002', 's004'],
               'class':['V', 'V', 'VI', 'VI', 'V', 'VI'],
               'name':['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
               'date_Of_Birth':['15/05/2002', '17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997'],
               'age':[12, 12, 13, 13, 14, 12], 'height':[173, 192, 186, 167, 151, 159], 'weight':[35, 32, 33, 30, 31, 32],
               'address':['street1', 'street2', 'street3', 'street1', 'street2', 'street4']}

In [4]:
df1 = pd.DataFrame(data_frame1)

In [5]:
df1.set_index(pd.Index(['S1', 'S2', 'S3', 'S4', 'S5', 'S6']))

   school class            name date_Of_Birth  age  height  weight  address
S1   s001     V  Alberto Franco    15/05/2002   12     173      35  street1
S2   s002     V    Gino Mcneill    17/05/2002   12     192      32  street2
S3   s003    VI     Ryan Parkes    16/02/1999   13     186      33  street3
S4   s001    VI    Eesha Hinton    25/09/1998   13     167      30  street1
S5   s002     V    Gino Mcneill    11/05/2002   14     151      31  street2
S6   s004    VI    David Parkes    15/09/1997   12     159      32  street4

In [6]:
d1 = (df1.groupby(df1.school).age.describe())[['mean', 'min', 'max']]

In [7]:
d1

        mean   min   max
school
s001    12.5  12.0  13.0
s002    13.0  12.0  14.0
s003    13.0  13.0  13.0
s004    12.0  12.0  12.0

In [8]:
'''2. Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group.
Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).

ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001
'''

'2. Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group.\nUsing the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).\n\nord_no  purch_amt    ord_date  customer_id  salesman_id\n0    70001     150.50  2012-10-05         3005         5002\n1    70009     270.65  2012-09-10         3001         5005\n2    70002      65.26  2012-10-05         3002         5001\n3    70004     110.50  2012-08-17         3009         5003\n4    70007     948.50  2012-09-10         3005         5002\n5    70005    2400.60  2012-07-27         3007         5001\n6    70008    5760.00  2012-09-10         3002         5001\n7    70010    1983.43  2012-10-10         3004         5006\n8    70003    2480.40  2012-10-10         3009         5003\n9    70012     250.45  2012-06-27         3008         5002\n10   70011      75.29  2012-08-17         3003         5007\n11   70013    3045.60  2012-04-25         3002         5001\n'

In [9]:
data_frame2 = {'ord_no':[70001, 70009, 70002, 70004, 70007, 70005],
               'purch_amt':[150.50, 270.65, 65.26, 110.50, 948.50, 2400.60],
               'ord_date':['2012-10-05', '2012-09-10', '2012-10-05', '2012-08-17', '2012-09-10', '2012-07-27'],
               'customer_id':[3005, 3001, 3002, 3009, 3005, 3007],
               'salesman_id':[5002, 5005, 5001, 5003, 5002, 5001]}

In [10]:
df2 = pd.DataFrame(data_frame2)

In [11]:
df2

   ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001     150.50  2012-10-05         3005         5002
1   70009     270.65  2012-09-10         3001         5005
2   70002      65.26  2012-10-05         3002         5001
3   70004     110.50  2012-08-17         3009         5003
4   70007     948.50  2012-09-10         3005         5002
5   70005    2400.60  2012-07-27         3007         5001

In [12]:
d2 = (df2.groupby('customer_id')['purch_amt'].describe())[['mean', 'min', 'max']]

In [13]:
d2

                mean      min      max
customer_id
3001          270.65   270.65   270.65
3002           65.26    65.26    65.26
3005          549.50   150.50   948.50
3007         2400.60  2400.60  2400.60
3009          110.50   110.50   110.50

In [14]:
'''3. Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups.

In the following dataset group on 'customer_id', 'salesman_id' and then sort sum of purch_amt within the groups.

 ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001'''

"3. Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups.\n\nIn the following dataset group on 'customer_id', 'salesman_id' and then sort sum of purch_amt within the groups.\n\n ord_no  purch_amt    ord_date  customer_id  salesman_id\n0    70001     150.50  2012-10-05         3005         5002\n1    70009     270.65  2012-09-10         3001         5005\n2    70002      65.26  2012-10-05         3002         5001\n3    70004     110.50  2012-08-17         3009         5003\n4    70007     948.50  2012-09-10         3005         5002\n5    70005    2400.60  2012-07-27         3007         5001\n6    70008    5760.00  2012-09-10         3002         5001\n7    70010    1983.43  2012-10-10         3004         5006\n8    70003    2480.40  2012-10-10         3009         5003\n9    70012     250.45  2012-06-27         3008         5002\n10   70011      75.29  2012-08-17         3003         5007\n11   70013    3045.60  2012-04-25         3002         5001"

In [15]:
d3 = pd.DataFrame((df2.groupby(["customer_id", "salesman_id"]))["purch_amt"].sum().sort_values())

In [16]:
d3

                         purch_amt
customer_id salesman_id
3002        5001             65.26
3009        5003            110.50
3001        5005            270.65
3005        5002           1099.00
3007        5001           2400.60

In [17]:
'''4.(a) Write a Pandas program to remove the duplicates from 'WHO region' column of World alcohol consumption dataset.

Year       WHO region                Country Beverage Types  Display Value
0  1986  Western Pacific               Viet Nam           Wine           0.00
1  1986         Americas                Uruguay          Other           0.50
2  1985           Africa           Cte d'Ivoire           Wine           1.62
3  1986         Americas               Colombia           Beer           4.27
4  1987         Americas  Saint Kitts and Nevis           Beer           1.98
'''

"4.(a) Write a Pandas program to remove the duplicates from 'WHO region' column of World alcohol consumption dataset.\n\nYear       WHO region                Country Beverage Types  Display Value\n0  1986  Western Pacific               Viet Nam           Wine           0.00\n1  1986         Americas                Uruguay          Other           0.50\n2  1985           Africa           Cte d'Ivoire           Wine           1.62\n3  1986         Americas               Colombia           Beer           4.27\n4  1987         Americas  Saint Kitts and Nevis           Beer           1.98\n"

In [18]:
data_frame3 = {'Year':[1986, 1986, 1985, 1986, 1987],
               'WHO region':['Western Pacific', 'Americas', 'Africa', 'Americas', 'Americas'],
               'Country':['Viet Nam', 'Uruguay', "Cte d'Ivoire", 'Colombia', 'Saint Kitts and Nevis'],
               'Beverage Types':['Wine', 'Other', 'Wine', 'Beer', 'Beer'],
               'Display Value':[0.00, 0.50, 1.62, 4.27, 1.98]}

In [19]:
df3 = pd.DataFrame(data_frame3)

In [20]:
df3

   Year       WHO region                Country Beverage Types  Display Value
0  1986  Western Pacific               Viet Nam           Wine           0.00
1  1986         Americas                Uruguay          Other           0.50
2  1985           Africa           Cte d'Ivoire           Wine           1.62
3  1986         Americas               Colombia           Beer           4.27
4  1987         Americas  Saint Kitts and Nevis           Beer           1.98

In [21]:
d4 = df3.drop_duplicates('WHO region')

In [22]:
d4

   Year       WHO region       Country Beverage Types  Display Value
0  1986  Western Pacific      Viet Nam           Wine           0.00
1  1986         Americas       Uruguay          Other           0.50
2  1985           Africa  Cte d'Ivoire           Wine           1.62

In [23]:
'''(b) Write a Pandas program to find out the alcohol consumption details in the year '1987' or '1989' from the world alcohol
consumption dataset.'''

"(b) Write a Pandas program to find out the alcohol consumption details in the year '1987' or '1989' from the world alcohol\nconsumption dataset."

In [24]:
df3[(df3.Year == 1987) | (df3.Year == 1989)]

   Year WHO region                Country Beverage Types  Display Value
4  1987   Americas  Saint Kitts and Nevis           Beer           1.98